reddit_on_rails/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "mod_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Test"], ["description", "Test"], ["mod_id", 1], ["created_at", "2018-07-17 21:05:26.976012"], ["updated_at", "2018-07-17 21:05:26.976012"]]
---
  def create
    @sub = Sub.new(sub_params)
    @sub.mod_id = current_user.id

    if @sub.save

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    if sub_mod?
      @sub = Sub.find(params[:id])

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "subs"."id" = $4  [["title", "New"], ["description", "New"], ["updated_at", "2018-07-17 21:06:48.689682"], ["id", 1]]
---
  def update
    @sub = Sub.find(params[:id])
    if @sub.update_attributes(sub_params)